fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОДокументах</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровИУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданОбработкой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеЗаРаботыАкты</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ФоновоеСозданиеАктов(ВходящиеПараметры) Экспорт
	
	// Безопасное извлечение даты из параметров длительной операции БСП
	Период = Неопределено;
	Если ТипЗнч(ВходящиеПараметры) = Тип("Массив") И ВходящиеПараметры.Количество() > 0 Тогда
		Период = ВходящиеПараметры[0];
	ИначеЕсли ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		ВходящиеПараметры.Свойство("Период", Период);
	Иначе
		Период = ВходящиеПараметры;
	КонецЕсли;
	
	// Защита на случай, если дата так и не пришла
	Если Не ЗначениеЗаполнено(Период) Или ТипЗнч(Период) <> Тип("Дата") Тогда
		ВызватьИсключение "Ошибка выполнения: Переданный параметр не является корректной датой!";
	КонецЕсли;
	
	Результат = Новый Структура;
	МассивСтрок = Новый Массив;
	СозданоДокументов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК СсылкаНаРеализацию
		|ПОМЕСТИТЬ ВТ_СуществующиеРеализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Договор,
		|	РеализацияТоваровУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
		|	ЕСТЬNULL(ВТ_СуществующиеРеализации.СсылкаНаРеализацию, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК РеализацияТоваровИУслуг
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуществующиеРеализации КАК ВТ_СуществующиеРеализации
		|		ПО ДоговорыКонтрагентов.Ссылка = ВТ_СуществующиеРеализации.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора, МЕСЯЦ) <= &Период
		|	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора, МЕСЯЦ) >= &Период
		|	И НЕ ДоговорыКонтрагентов.Наименование ЕСТЬ NULL
		|	И НЕ ДоговорыКонтрагентов.Владелец.Наименование ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоОбъектов = Выборка.Количество();
	ОбработаноОбъектов = 0;
	ПустаяСсылкаРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДанных = Новый Структура("Договор, РеализацияТоваровИУслуг, СозданОбработкой");
		СтрокаДанных.Договор = Выборка.Договор;
		
		Если Выборка.РеализацияТоваровИУслуг = ПустаяСсылкаРеализации Тогда
			
			СсылкаНаДокумент = СоздатьДокументРеализацияТоваровУслуг(Выборка, Период);
			
			Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда 
				СозданоДокументов = СозданоДокументов + 1;
				СтрокаДанных.СозданОбработкой = Истина; // Новый документ - ставим галочку
				СтрокаДанных.РеализацияТоваровИУслуг = СсылкаНаДокумент;
			Иначе
				СтрокаДанных.СозданОбработкой = Ложь;
				СтрокаДанных.РеализацияТоваровИУслуг = ПустаяСсылкаРеализации;
			КонецЕсли;
			
		Иначе
			// Документ уже существовал до запуска обработки.
			// Выводим его в таблицу, но галочку НЕ ставим (Ложь)
			СтрокаДанных.СозданОбработкой = Ложь;
			СтрокаДанных.РеализацияТоваровИУслуг = Выборка.РеализацияТоваровИУслуг; 
		КонецЕсли;
		
		МассивСтрок.Добавить(СтрокаДанных);
		ОбработаноОбъектов = ОбработаноОбъектов + 1;
		
		Если ВсегоОбъектов > 0 Тогда
			ДлительныеОперации.СообщитьПрогресс(ОбработаноОбъектов / ВсегоОбъектов * 100);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Вставить("МассивСтрок", МассивСтрок);
	Результат.Вставить("СозданоДокументов", СозданоДокументов);
	
	Возврат Результат;
	
КонецФункции     

Функция СоздатьДокументРеализацияТоваровУслуг(Выборка, Период)
	
	СсылкаНаДокумент = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, Выборка);
	
	НовыйДокумент.Дата = КонецМесяца(Период);
	
	ИмяПользователяБД = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	НовыйДокумент.Ответственный = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователяБД);
	
	НовыйДокумент.Комментарий = "Документ создан автоматически обработкой ""Массовое создание актов""";
	
	НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();

	Если НовыйДокумент.ПроверитьЗаполнение() Тогда
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			СсылкаНаДокумент = НовыйДокумент.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации("Автоматическое создание актов",
				УровеньЖурналаРегистрации.Ошибка, , , 
				ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Возврат СсылкаНаДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
